# მოდულის მუდმივები; ხელი არ ახლოთ!
SEC_IN_MIN = 60
MIN_IN_HOUR = 60
HOUR_IN_DAY = 24
DAY_IN_WEEK = 7
WEEK_IN_YEAR = 52

"""
0. დაწერეთ ფუნქცია რომელიც არგუმენტად მიწოდბულ წლებს 
წამებში გადაიყვანს


:param wlebi: float წლების რაოდენობა
:return: float შედეგად მიღებული წამები
"""

"""
1. დაწერეთ ფუნქცია რომელიც არგუმენტად მიწოდბულ კვირებს 
წამებში გადაიყვანს 


:param kvirebi: float კვირების რაოდენობა
:return: float შედეგად მიღებული წამები
"""

"""
2. დაწერეთ ფუნქცია რომელიც არგუმენტად მიწოდბულ დღეებს 
წამებში გადაიყვანს 


:param dgheebi: float დღეების რაოდენობა
:return: float შედეგად მიღებული წამები
"""

"""
3. დაწერეთ ფუნქცია რომელიც არგუმენტად მიწოდბულ საათებს 
წამებში გადაიყვანს


:param saatebi: float საათების რაოდენობა
:return: float შედეგად მიღებული წამები
"""

"""
4. დაწერეთ ფუნქცია რომელიც არგუმენტად მიწოდბულ წუთებს 
წამებში გადაიყვანს


:param tsutebi: float წუთების რაოდენობა
:return: float შედეგად მიღებული წამები
"""

