# შემოიტანეთ მოდული gadayvanebi
import gadayvanebi as gd

CASES = [
    "წლების გადაყვანა წამებში",
    "კვირების გადაყვანა წამებში",
    "დღეების გადაყვანა წამებში",
    "საათების გადაყვანა წამებში",
    "წუთების გადაყვანა წამებში"
]


"""
0.

ამოწმებს არგუმენტად მიწოდებული სტრიქონი არის თუ არა
ამ მოდულის გლობალურ მუდმივა, CASES-ებში. იმ შემთხვევაში თუ
არგუმენტი ამ სიის წევრი არ არის, ფუნქცია დააბრუნებს None-ს.

სხვა შემთხვევაში gadayvanebi მოდულიდან საჭირო ფუნქცია გამოიძახეთ,
მომხმარებელს შეატანინე საჭირო არგუმენტი და გადააწოდე საჭირო ფუნქციას
და მიღებულ შედეგს ფუნქციიდან აბრუნებს.

**მაგალითად**: მომხმარებელმა თუ შემოიტანა "კვირების გადაყვანა წამებში",
სთხოვე შეიტანოს რამდენი კვირის გადაყვანა სსურს წამებში და gadayvanebi
მოდულიდან გამოიძახე მე-1 ფუნქცია


:param user_input: str - მომხმარებლის მიერ შეტანილი
:return: int - დროის გადაყვანის შედეგი
None - იმ შემთხვევაში, თუ არგუმენტად მიწოდებული სტრიქონი
არ არის მოდულის გლობალური მუდმივის, CASES-ის, ნაწილი
"""


def main():
    """
    გინდა,რომ უსასრულობასთან ჯანსაღი ურთიერთობა დაამყარო და ამითი შეძლო
    აწმყოში უკეთ ყოფნა. "მემენტო მორი", როგორც რომის იმპერიის დროს,
    ტრიუმფალურ კეისრებს უჩურჩულებდნენ ყურში. "როდესაც იყურები უფსკრულში,
    უნდა იცოდე, რომ უფსკრულიც შემოგყურებს შენ," როგორც ულვაშებიანი ნიცშე
    იტყოდა ხოლმე.
    """
    # 0. აწარმოეთ უსასრულო ციკლი, მანამ, სანამ მომხმარებელი არ შეიტანს
    # **თქვენს მიერ განსაზღვრულ** ციკლიდან გამოსასვლელ სტრიქონს.
    # თითო იტერაციაზე, შეასრულეთ შემდეგი:
    #   ა. მომხმარებლის მიერ შეტანილი სტრიქონი მე-0 დამხმარე ფუნქციას
    #   არგუმენტად გადაეცი.
    #
    #   ბ. თუ წინა ნაბიჯის შედეგად მიღებული მონაცემი არ არის None,
    #   დაუბეჭდე მომხმარბეელს და განაგრძე იტერაცია მანამ,
    #   სანამ მომხაბრელი არ შეიტანს ციკლიდან გამოსასვლეელ სტრიქონს

    # 1. ციკლის წარმატებულად დამთავრების შედეგად დაემშვიდობე მომხმარებელს

main()