# შემოიტანე მოდული macivari; თუ გინდა მთლიანად, თუ გინდა კონკრეტული
# ნაწილები, და თუ გინდა, ფესვდონიმების მინიჭებით



def main():
    """
    მთავარი ფუნქცია. ფუნქციის ტანში, კომენტრაის სახით გაწერილ ინსტრუქციებს
    მიყევით.

    :return:
    """
    # 0. მომხმარებელს ჰკითხე, რამდენი ნივთის ამოტანა სსურს:
    # ა. პასუხი ცვლადში შეინახე; დაიფქრდი, ეს აუცილებლად რამე
    # "რიცხვის" ტიპი უნდა იყოს


    # 1. macivari მოდულიდან გამოიძახე ფუნქცია, chaitsere_sayidlebi:
    # ა. გაჩუმებით არგუმენტად, მიახოდე მ-0 ნაბიჯში წარმოებული ცვლადი
    # ბ. შედეგად მიღებუკუ სია შეინახე ცვლადში


    # 2. macivari მოდულიდან გამოიძახე ფუნქცია, sheavse_macivari:
    # ა. არგუმენტად მიაწოდე მე-1 ნაბიჯის შედეგად მიღებული ცვლადი
    # ბ. შედეგად მიღებული ლექსიკონი შეინახე ცვლადში



    # 3. macivari მოდულიდან გამოიძახე ფუნქცია, macivris_shemotsmeba:
    # ა. არგუმენტად მიაწოდე მე-2 ნაბიჯის შედეგად მიღებული ლექსიკონი


    # 4. ციკლის მეშვეობით, მომხმარებელს 3-ჯერ ჰკითხე:
    # ა. რა აქვს ნაყიდი? პასუხი შეინახე ცვლადში
    # ბ. macivari მოდულიდან გამოიძახე ფუნქცია, gamoakle_nivti:
    #     - არგუმენტად მიაწოდე მე-2 ნაბიჯის შედეგად მიღებული
    #     ლიექსკონი და 4.ა ნაბიჯში შენახული ნივთი


    # 5. macivari მოდულიდან გამოიძახე ფუნქცია, macivris_shemotsmeba:
    # ა. არგუმენტად მიაწოდე მე-2 ნაბიჯის შედეგად მიღებული ლექსიკონი



main()
