# რესტორნის კერძები და მათI ინგრედიენტები
KERDZEBI = {
    'შაურმა': {
        'ფასი': 11.00,
        'ინგრედიენტები': {
            'წიწაკა': {
                'რაოდენობა': 'საშუალო'
             },

            'ლავაში': {
                'რაოდენობა': 'საშუალო'
             },

            'ხორცი': {
                'რაოდენობა': 'საშუალო'
             },

            'პომიდორი': {
                'რაოდენობა': 'საშუალო'
             },

            'სალათის ფურცელი': {
                'რაოდენობა': 'საშუალო'
             },

            'კეტჩუპი': {
                'რაოდენობა': 'საშუალო'
             },

            'მაიონეზი': {
                'რაოდენობა': 'საშუალო'
             },

            'ხახვი': {
                'რაოდენობა': 'საშუალო'
             }
        }
    },
    'ბურგერი': {
        'ფასი': 20.00,
        'ინგრედიენტები': {
            'პური': {
                    'რაოდენობა': 'საშუალო'
                 },
            'ხორცი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'ხახვი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'პომიდორი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'კეტჩუპი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'სალათის ფურცელი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'სოუსი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'ყველი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'სოკო': {
                    'რაოდენობა': 'საშუალო'
                 }
        }
    },
    'პიცა': {
        'ფასი': 18.00,
        'ინგრედიენტები': {
            'ყველი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'სოუსი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'ზეთისხილი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'ხორცი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'ხახვი': {
                    'რაოდენობა': 'საშუალო'
                 },
            'სოკო': {
                    'რაოდენობა': 'საშუალო'
                 }
        }
    }
}

# რესტორნის ინგრედიენტების რაოდენობის ფასები
RAODENOBEBIS_FASEBI = {
    'ნაკლები': {
        'ფასი': 0.00
    },
    'საშუალო': {
        'ფასი': 0.00
    },
    'მეტი': {
        'ფასი': 1.50
    }
}

"""
0.
გამოითვლის კერძის ფასს, ყველანაირი დამატებითი ინგრედიენტებების
გათვალისწინებით.


ა. იღებს არგუმენტად მოცემული ლექსიკონის ფასს და ინახავს ცვლადში;
'ფასი'-ს გასაღებით აკითხავს საჭირო მნიშვნელობას.

ბ. შემდეგ, იღებს არგუმენტად მოცემული ლექსიკონის ინგრედიენტების ქველექსიკონს
და ინახავს ცვლადში; 'ინგრედიენტები'-ს გასაღებით აკითხავს მნიშვნელობას.

გ. წინა ნაბიჯში მიღებულ ინგრედიენტების ქველექსიკონის თითო ელემენტზე ასრულებს
იტერაციას და თითო იტერაციაზე ასრულებს შემდეგს:
    1. ამ ინგრედიენტების ქველექსიკონის, იტერაციის წყვილის გასაღებით 
    მითითებულ ქველექსიკონში გასაღები 'რაოდენობა'-თი მითითებულ 
    მნიშვნელობას ინახავს ცვლადში; ეს იქნება შემდეგ ჩამონათვალიდან 
    ერთ-ერთი სტრიქონი - "მეტი", 'ნაკლები', 'საშუალო'
    
    2. ამ მოდულში არსებული მუდმივის, RAODENOBEBIS_FASEBI-ის, ქველექსიკონს
    აკითხავს, წინა 1-ელ ნაბიჯში მიღებული სტრიქონით და მასში მოთავსებული
    ქველექსიკონიდან ფასს იღებს და ინახავს ცვლადში; ამ მნიშვენლობას 
    აკითხავს გასაღებით, 'ფასი'
    
    3. წინა ნაბიჯში მიღებულ ფასს უმატებს 'ა' ნაბიჯში მიღებულ ცვლადს
    
დ. ციკლის დამთავრების შედეგად აბრუნებს 'ა' ნაბიჯში შექმნილ ცვლადს;
ეს იქნება შეკვეთის სრული ფასი
    

:param kerdzi: dict - კერძის მომცველი ლექსიკონი
:return: float - კერძის ფასი
"""

def calculateDishPrice(kerdzi):
    price = kerdzi['ფასი']
    ingredientebi = kerdzi['ინგრედიენტები']
    for i in ingredientebi:
        item = ingredientebi[i]['რაოდენობა']
        itemPrice = RAODENOBEBIS_FASEBI[item]['ფასი']
        price += itemPrice
    return price


"""
1.
შეკვეთილ კერძს შეკვეთისდამიხედვით უცვლის ინგრედიენტების რაოდენობებს.

ა. მე-1 არგუმენტში, kerdzi-ში, 'ინგრედიენტები'-ს
გასაღებით აკითხავს ქველექსიკონს და ცვლადში ინახავს.

ბ. შემდეგ კი მე-2 არგუმენტის, raodenobebi-ის, თითო წყვილზე
ახდენს იტერაციას და შემდეგს ასრულებს:
    1. იღებს წყვილის მნიშვნელობას და ინახავს ცვლადში
    2. 'ა' ნაბიჯში მიღებულ ლექსიკონში იტერაციის წყვილის გასაღებით 
    მითითებულ ქველექსიკონში გასაღები 'რაოდენობა'-თი მითითებულ 
    მნიშვენლობას ზედ აწერს; უთითებს წინა, 1-ელ ნაბიჯში მიღებულ 
    მნიშვნელობას.

:param kerdzi: dict - კერძის მომცველი ლექსიკონი
:param raodenobebi: dict - რაოდენობების ლექსიკონი
**მაგალითად**, გამოიყურება ასე:
{
    'ხახვი': 'მეტი',
    'სოუსი': 'ნაკლები'
}
- სადაც თითო გასაღები არის kerdzi ლექსიკონში არსებული ინგრედიენტი
- სადაც თითო გასაღებით მითითებული მნიშვნელობა არის RAODENOBIS_FASEBI-ში
არსებული გასაღები
"""
def changeComponents(kerdzi,raodenobebi):
    ingredientebi = kerdzi['ინგრედიენტები']
    for i in raodenobebi:
        ingredientebi[i]['ფასი'] = RAODENOBEBIS_FASEBI[raodenobebi[i]]['ფასი']
    kerdzi['ინგრედიენტები'] = ingredientebi
    return kerdzi

def shekvetis_migheba(kerdzi, ingredientebi=None):
    """
    2.

    არგუმენტად მიწოდებული კერძის სახელით
    ამ მოდულში მოცემული მუდმივაში, KERDZEBI-ში, ქველექსიკონს პოულობს და
    მის ასლს ინახავს ცალკე ცვლადში.

    შემდეგ კი ამოწმებს, თუ გაჩუმებითი პარამეტრის, ingredientebi-ს,
    არგუმენტი არ არის None ტიპის, გამოიძახებს  ამ მოდულში არსებულ მე-1
    დამხმარე ფუნქციას და არგუმენტებად მიაწოდებს kerdzi და ingredientebi-ს
    ცვლადებს.

    ბოლოს კი მე-0 ფუნქციის გამოძახებით გამოითვლის და დააბრუნებს შეკვეთის
    ფასს.

    :param kerdzi: str - კერძის სახელი
    :param ingredientebi: dict - გაჩუმებითი პარამეტრი. გაჩუმებით უდრის None-ს.
    შეკვეთი დამატებითი ინგრედიენტების ამსახველი ლექსიკონი.
    :return: float - კერძის ფასი
    """
    orderItem = KERDZEBI[kerdzi]

    if ingredientebi != None:
        orderItem = changeComponents(orderItem, ingredientebi)
    return calculateDishPrice(orderItem)


#print(calculateDishPrice(KERDZEBI['შაურმა']))
#print(changeComponents(KERDZEBI['შაურმა'],{
#   'ხახვი': 'მეტი',
#  'სოუსი': 'ნაკლები'
#}))

#print(shekvetis_migheba('შაურმა', {
#   'ხახვი': 'მეტი',
#  'კეტჩუპი': 'ნაკლები'
#}))
