# შემოიტანეთ sachmeli მოდული, როგორც გინდა, თუ გინდა
# მხოლოდ random_churchkelis_zomebi, თუ გინდა ფსევდონიმიც მიანიჭე
from sachmeli import random_churchkelis_zomebi as rchurchkela



def yvelaze_patara(sachmeli):
    """
    მიწოდებული საჭმლის მოცულობების სიიდან, ყველაზე პატარა მოცულობის საწმლის
    მნიშვნელობას აბრუნებს

    :param sachmeli: list სია, რომელშიც მოთავსებულია ჩურჩხელის მოცულობები
    :return: float ნამდვილი რიცხვის მონაცემთა ტიპი, რომელიც წარმოადგენს
    სიაში ყველაზე პატარა მთელრიცხვა ტიპს
    """
    pass


def yvelaze_didi(sachmeli):
    """
    მიწოდებული საჭმლის მოცულობების სიიდან, ყველაზე დიდი მოცულობის საჭმლის
    მნიშვნელობას აბრუნებს

    :param sachmeli: list სია, რომელშიც მოთავსებულია ჩურჩხელის მოცულობები
    :return: float ნამდვილი რიცხვის მონაცემთა ტიპი, რომელიც წარმოადგენს
    სიაში ყველაზე დიდ მთელრიცხვა ტიპს
    """
    pass


def churchkhelis_agheba(churchkhelebi, raodenoba=2):
    """
    მომხმარებელს ეკიტხება, არგუმენტად მიწოდებული ჩურჩხელებიდან,
    ყველაზე დიდი თუ ყველაზე პატარა ჩურჩხელის აღება სსურს.

    0. იმდენჯერ, რამდენიც არგუმენტი raodenoba-თი არის მიწოდებული:
        ა. მომხმარებელს გასაგებად ეკითხება, ყველაზე დიდი თუ ყველაზე პატარა
        ჩურჩხელების აღება სსურს და მის კონსოლში შეყვანილ პასუხს ცვლადში
        ინახავს
        ბ. წინა ნაბიჯის შედეგად მიღებულ ცვლადს ამოწმებს:
            0. თუ ის == 'დიდი':
                - ბეჭდავს yvelaze_didi ფუნქციის შედეგს, არგუმენტად აწვდის
                churchkhelebi-ს

            1. თუ ის == 'პატარა':
                - ბეჭდავს yvelaze_patara ფუნქციის შედეგს, არგუმენტად აწვდის
                churchkhelebi-ს

            2. სხვა შემთხვევაში, ჩათვალეთ რომ მომხმარებელს არც ერთი ჩურჩხელა არ
            ნდომებია და კონსოლში რამე ტექსტი გამოიტანე, უკუკავშირულად

    :param churchkhelebi: list სია, რომლის თითო ელემენტი წარმოადგენს ჩურჩხელის
    მოცულობას
    :param raodenoba: float ნამდვილი რიცხვის მონაცემთა ტიპი, რომელიც
    წარმოადგენს თუ რამდენ კითხვას ვუსვამთ მომხმარებელს
    """
    pass


def main():
    """
    მთავარი ფუნქცია. ფუნქციის ტანში, კომენტრაის სახით გაწერილ ინსტრუქციებს
    მიყევით.
    """
    # 0.sachemli მოდულიდან, random_churchkelis_zomebi ფუნქცია გამოიძახე
    # და შედეგი მოათავსე ცვლადში


    # 1. დაბეჭდე ცვლადი


    # 2. გამოიძახე ჩურჩხელის აღების ფუნქცია, churchkhelis_agheba



main()
